#+title: rune
**** Tagged Arithmetic

| op      | low any | low zero | high any | high zero | sign ext |
|---------+---------+----------+----------+-----------+----------|
| is      |       3 |        2 |        3 |         2 |        4 |
| wrap    |       2 |        1 |        4 |         2 |        0 |
| unwrap  |       1 |        1 |        2 |         2 |        0 |
| negate  |       2 |        1 |        3 |         3 |        1 |
| add/sub |       2 |        1 |        4 |         4 |        4 |
| mul     |       5 |        2 |        5 |         5 |        3 |
| div     |       5 |        2 |        6 |         6 |        3 |
| ineq    |       2 |        2 |        4 |         4 |        2 |
| total   |      22 |       12 |       31 |        28 |       17 |
#+TBLFM: $2=vsum(@2..@-1)::$3=vsum(@2..@-1)::$4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

Seems like either low-zero or sign ext is the way to go. The biggest problem
with sign ext is the expensive ~is~ test. But is also doesn't have a cost to
wrapping and unwrapping. But with low-zero we can do arithmetic without
unwrapping, which could make up for it.
